reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  Athena Rover 2026 — Firmware ESP32-S3
//  Retos del Rover H07 · INTEC · Reymildo & Montse
// ===========================================================================
//
//  TODO el firmware vive en este archivo, a propósito. Cada subsistema del
//  robot corre en su propia tarea de FreeRTOS, independiente de las demás,
//  comunicadas SOLO por colas explícitas. Un fallo en una tarea no bloquea
//  ni tumba a las otras.
//
//  Dependencias externas: NINGUNA. Solo el framework Arduino-ESP32 (que ya
//  trae FreeRTOS) y su librería Wire. Los drivers del PCA9685 y del TCS34725
//  están escritos aquí mismo: son un puñado de registros I2C cada uno, y
//  escribirlos nos da control total sobre tiempos y ganancia.
//
//  HARDWARE
//    · 2x L298N            -> 4 motores (cada driver mueve 2)
//    · 1x PCA9685 (I2C)    -> 2 servos del gripper (pinza + elevación)
//    · 2x TCS34725 (I2C)   -> sensor de color delantero y trasero
//    · 1x VL53L1X (I2C)    -> telémetro delante del gripper, distancia a la bandera
//    · 2x QTRX-HD-01A      -> reflectancia delantera izquierda y derecha
//    · LED RGB (1x)        -> identificación de equipo (lo exige el reglamento);
//                             antes eran 2 LED discretos rojo/azul, ya no existen
//    · Enlace con la Raspberry Pi por USB (CDC nativo)
//
//  ÍNDICE
//    [1] Configuración: pines, prioridades, stacks, periodos
//    [2] Tipos compartidos entre tareas
//    [3] Protocolo serial con la Raspberry Pi (formato de cable exacto)
//    [4] Colas
//    [5] Watchdog cooperativo (heartbeats)
//    [6] Driver PCA9685 (servos por I2C)
//    [7] Driver TCS34725 (sensores de color por I2C)
//    [8] Tareas
//    [9] setup() / loop()
//
// ===========================================================================

#include <Arduino.h>
#include <Wire.h>
#include <VL53L1X.h>

// ===========================================================================
//  [1] CONFIGURACIÓN
// ===========================================================================
//
//  PINES PROHIBIDOS en el ESP32-S3 DevKitC-1 — respetarlos no es opcional:
//    GPIO 19, 20    -> USB nativo (D-/D+). Es por donde habla la Raspberry Pi.
//    GPIO 43, 44    -> U0TXD/U0RXD, puerto de programación y depuración.
//    GPIO 26..32    -> flash SPI interna. Tocarlos cuelga el chip.
//    GPIO 33..37    -> PSRAM Octal (módulos N8R8/N16R8). Igual de intocables.
//    GPIO 0, 45, 46 -> pines de strapping: su nivel al arranque decide el modo
//                      de boot. Si algo los tira a un nivel raro, el ESP32 no
//                      arranca. Evitarlos.
//    GPIO 3         -> strapping de JTAG. Se puede usar, pero mejor no.
//
//  Además: los sensores analógicos DEBEN ir en ADC1 (GPIO 1..10). El ADC2
//  queda inutilizable en cuanto se enciende el WiFi.

namespace Pins {
    // -------- Motores: 2x L298N, cada uno mueve 2 motores ------------------
    // Driver IZQUIERDO -> motor delantero izq. (FL) y trasero izq. (RL)
    constexpr uint8_t L298N_L_IN1 = 4;    // FL sentido A
    constexpr uint8_t L298N_L_IN2 = 5;    // FL sentido B
    constexpr uint8_t L298N_L_ENA = 6;    // FL velocidad (PWM)
    constexpr uint8_t L298N_L_IN3 = 7;    // RL sentido A
    constexpr uint8_t L298N_L_IN4 = 15;   // RL sentido B
    constexpr uint8_t L298N_L_ENB = 16;   // RL velocidad (PWM)

    // Driver DERECHO -> motor delantero der. (FR) y trasero der. (RR)
    constexpr uint8_t L298N_R_IN1 = 10;   // FR sentido A
    constexpr uint8_t L298N_R_IN2 = 11;   // FR sentido B
    constexpr uint8_t L298N_R_ENA = 12;   // FR velocidad (PWM)
    constexpr uint8_t L298N_R_IN3 = 13;   // RR sentido A
    constexpr uint8_t L298N_R_IN4 = 14;   // RR sentido B
    constexpr uint8_t L298N_R_ENB = 17;   // RR velocidad (PWM)

    // -------- Bus I2C nº0: PCA9685 (servos) + TCS34725 DELANTERO -----------
    constexpr uint8_t I2C0_SDA = 8;
    constexpr uint8_t I2C0_SCL = 9;

    // -------- Bus I2C nº1: TCS34725 TRASERO --------------------------------
    // Los dos TCS34725 tienen la MISMA dirección fija (0x29) y no se puede
    // cambiar. Por eso van en buses separados: el ESP32-S3 tiene dos
    // controladores I2C, así nos ahorramos el multiplexor TCA9548A.
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- LED de iluminación de cada TCS34725 ---------------------------
    // Pin "LED" de la placa del sensor: enciende sus 2 LED blancos para no
    // depender de la luz ambiente del salón al clasificar el color del piso.
    constexpr uint8_t TCS_LED_FRONT = 18;
    constexpr uint8_t TCS_LED_BACK  = 21;

    // -------- VL53L1X (ToF), delante del gripper ---------------------------
    // Va en el bus I2C nº1 (mismo que el TCS34725 trasero). Los dos chips
    // arrancan en la MISMA dirección fija 0x29, así que el VL53L1X necesita
    // este pin XSHUT para quedarse en reset (sin responder en el bus) hasta
    // que se le reasigna una dirección nueva — ver TofSensorTask y la nota
    // en I2CAddr::VL53L1X_BOOT_ADDR más abajo para el riesgo que esto implica.
    constexpr uint8_t TOF_XSHUT = 40;

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! La salida del QTRX es proporcional a su VIN: a
    // 5 V entregaría hasta 5 V y eso quema la entrada ADC del ESP32-S3.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    // Pin CTRL de los emisores IR, compartido por ambos sensores. Permite
    // apagar los LED infrarrojos para medir la luz ambiente y restarla.
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo -----------------------------------
    // Reemplaza a los 2 LED discretos rojo/azul que documentaba antes esta
    // sección (GPIO 40/41): el equipo ya no los tiene montados, solo queda
    // este único LED RGB. Usa los 3 GPIO que quedaban libres para
    // ampliaciones (ver hardware/conexiones-esp32-s3.md). GPIO 3 es
    // strapping de JTAG, pero solo importa su nivel al bootear/resetear: como
    // salida PWM en operación normal no da problema.
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 3;
}

