reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  [2] TIPOS COMPARTIDOS ENTRE TAREAS
// ===========================================================================
//
//  Regla de diseño: no existe un "estado global del robot". Cada tarea es
//  dueña de sus datos y los publica por cola. Esto evita mutex compartidos y,
//  con ellos, la clase de bloqueos donde un subsistema lento congela a otro.

enum class TeamColor     : uint8_t { NONE = 0, RED = 1, BLUE = 2 };
enum class MotorMode     : uint8_t { STOP = 0, DRIVE = 1 };
enum class GripperAction : uint8_t { OPEN = 0, CLOSE = 1, RAISE = 2, LOWER = 3 };
enum class ColorLabel    : uint8_t { UNKNOWN = 0, BLACK, YELLOW, RED, BLUE, FLOOR };

struct MotorCommand {
    MotorMode mode = MotorMode::STOP;
    int8_t    left  = 0;   // -100..100 (%), lado izquierdo (FL+RL)
    int8_t    right = 0;   // -100..100 (%), lado derecho  (FR+RR)
};

struct GripperCommand {
    GripperAction action = GripperAction::OPEN;
};

struct LedCommand {
    TeamColor team = TeamColor::NONE;
};

struct ColorReading {
    uint32_t   timestamp_ms = 0;
    ColorLabel front        = ColorLabel::UNKNOWN;
    ColorLabel back         = ColorLabel::UNKNOWN;
    bool       front_valid  = false;
    bool       back_valid   = false;
};

struct ReflectanceReading {
    uint32_t timestamp_ms  = 0;
    uint16_t left_raw      = 0;
    uint16_t right_raw     = 0;
    bool     left_on_line  = false;
    bool     right_on_line = false;
};

struct TofReading {
    uint32_t timestamp_ms = 0;
    uint16_t distance_mm  = 0;
    bool     valid        = false;
};

struct HealthReport {
    uint32_t timestamp_ms          = 0;
    uint8_t  faulted_tasks_bitmask = 0;  // bit i = TaskId i encontrada colgada
};

// ===========================================================================
//  [3] PROTOCOLO SERIAL CON LA RASPBERRY PI
// ===========================================================================
//
//  Trama:  [0xAA][TYPE][LEN][PAYLOAD ... LEN bytes][CHECKSUM]
//
//    TYPE     : 1 byte, ver PacketType.
//    LEN      : 1 byte, tamaño del payload.
//    CHECKSUM : 1 byte, XOR de TYPE, LEN y todos los bytes del payload.
//
//  DECISIÓN IMPORTANTE: el payload se arma y se lee BYTE A BYTE, en
//  little-endian, nunca con memcpy de un struct. Mandar structs crudos por el
//  cable es una trampa clásica: el compilador inserta padding invisible entre
//  campos, y ese padding no tiene por qué coincidir con lo que Python asuma
//  del otro lado. Serializando a mano, el contrato queda fijo y verificable.
//  Los booleanos viajan empacados en bits por la misma razón (sizeof(bool) no
//  está garantizado).
//
//  ---------------------------------------------------------------------
//   RPi -> ESP32
//  ---------------------------------------------------------------------
//   0x01 CMD_MOTOR    len=3   [0]=mode(0=STOP,1=DRIVE) [1]=left i8 [2]=right i8
//   0x02 CMD_GRIPPER  len=1   [0]=action(0=OPEN,1=CLOSE,2=RAISE,3=LOWER)
//   0x03 CMD_LED      len=1   [0]=team(0=NONE,1=RED,2=BLUE)
//
//  ---------------------------------------------------------------------
//   ESP32 -> RPi
//  ---------------------------------------------------------------------
//   0x10 TLM_COLOR    len=7   [0..3]=timestamp_ms u32 LE
//                             [4]=front_label  [5]=back_label
//                             [6]=flags: bit0=front_valid, bit1=back_valid
//   0x11 TLM_REFLECT  len=9   [0..3]=timestamp_ms u32 LE
//                             [4..5]=left_raw u16 LE  [6..7]=right_raw u16 LE
//                             [8]=flags: bit0=left_on_line, bit1=right_on_line
//   0x12 TLM_HEALTH   len=5   [0..3]=timestamp_ms u32 LE
//                             [4]=faulted_tasks_bitmask
//   0x13 TLM_TOF      len=7   [0..3]=timestamp_ms u32 LE
//                             [4..5]=distance_mm u16 LE
//                             [6]=flags: bit0=valid
//
//  El lado Python vive en raspberry-pi/src/athena/protocol.py y DEBE
//  mantenerse sincronizado con este bloque. El test
//  raspberry-pi/tests/test_protocol.py lee ESTE archivo y compara los valores,
//  así que si alguien cambia un número aquí y no allá, el test falla.

namespace Proto {
    constexpr uint8_t START_BYTE  = 0xAA;
    constexpr uint8_t MAX_PAYLOAD = 32;

    enum PacketType : uint8_t {
        CMD_MOTOR   = 0x01,
        CMD_GRIPPER = 0x02,
        CMD_LED     = 0x03,
        TLM_COLOR   = 0x10,
        TLM_REFLECT = 0x11,
        TLM_HEALTH  = 0x12,
        TLM_TOF     = 0x13,
    };

    constexpr uint8_t LEN_CMD_MOTOR   = 3;
    constexpr uint8_t LEN_CMD_GRIPPER = 1;
    constexpr uint8_t LEN_CMD_LED     = 1;
    constexpr uint8_t LEN_TLM_COLOR   = 7;
    constexpr uint8_t LEN_TLM_REFLECT = 9;
    constexpr uint8_t LEN_TLM_HEALTH  = 5;
    constexpr uint8_t LEN_TLM_TOF     = 7;

    // Tipos que el ESP32 puede RECIBIR. Solo comandos: la telemetria va en la
    // otra direccion. Validar el byte de tipo contra esta lista es lo que le
    // permite al parser resincronizar cuando llega basura por el cable: sin
    // esto, un 0xAA suelto justo antes de una trama valida se traga esa trama.
    inline bool IsReceivableType(uint8_t type) {
        return type == CMD_MOTOR || type == CMD_GRIPPER || type == CMD_LED;
    }

    inline uint8_t Checksum(uint8_t type, uint8_t len, const uint8_t *payload) {
        uint8_t c = type ^ len;
        for (uint8_t i = 0; i < len; ++i) c ^= payload[i];
        return c;
    }

    inline void WriteU16LE(uint8_t *dst, uint16_t v) {
        dst[0] = (uint8_t)(v & 0xFF);
        dst[1] = (uint8_t)((v >> 8) & 0xFF);
    }

    inline void WriteU32LE(uint8_t *dst, uint32_t v) {
        dst[0] = (uint8_t)(v & 0xFF);
        dst[1] = (uint8_t)((v >> 8) & 0xFF);
        dst[2] = (uint8_t)((v >> 16) & 0xFF);
        dst[3] = (uint8_t)((v >> 24) & 0xFF);
    }
}

// ===========================================================================
//  [4] COLAS
// ===========================================================================
//
//   RPi --USB--> SerialTask --> motorCmdQueue   (len 1, overwrite) --> MotorTask
//                           --> gripperCmdQueue (len 4, FIFO)      --> GripperTask
//                           --> ledCmdQueue     (len 1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (len 4, FIFO)      --> SerialTask --USB--> RPi
//   ReflectanceTask --> reflectQueue (len 4, FIFO)      --> SerialTask --USB--> RPi
//   TofSensorTask   --> tofQueue     (len 4, FIFO)      --> SerialTask --USB--> RPi
//   SupervisorTask  --> healthQueue  (len 1, overwrite) --> SerialTask --USB--> RPi
//
//  Las colas "overwrite" (largo 1) son para datos donde solo importa el valor
//  más reciente: un comando de motores viejo no debe ejecutarse nunca. Las
//  FIFO son para eventos que deben procesarse todos y en orden (el gripper
//  tiene que abrir ANTES de bajar, no al revés).
//
//  Regla que se respeta en todo el archivo: ninguna tarea usa portMAX_DELAY
//  dentro de su bucle principal. Todas las operaciones de cola llevan timeout
//  0, de forma que un productor lento jamás cuelgue al consumidor.

