reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
static QueueHandle_t g_motorCmdQueue   = nullptr;
static QueueHandle_t g_gripperCmdQueue = nullptr;
static QueueHandle_t g_ledCmdQueue     = nullptr;
static QueueHandle_t g_colorQueue      = nullptr;
static QueueHandle_t g_reflectQueue    = nullptr;
static QueueHandle_t g_tofQueue        = nullptr;
static QueueHandle_t g_healthQueue     = nullptr;

// ===========================================================================
//  [5] WATCHDOG COOPERATIVO
// ===========================================================================
//
//  Cada tarea marca su heartbeat en cada vuelta de su bucle. El supervisor
//  revisa quién dejó de marcar.
//
//  Cada tarea escribe SOLO su propia celda del arreglo y el supervisor solo
//  lee, así que no hace falta mutex: no hay dos escritores para la misma
//  celda, y un uint32_t se escribe de forma atómica en esta arquitectura, de
//  modo que el supervisor nunca puede leer un valor a medias.

static volatile uint32_t g_lastHeartbeatMs[(size_t)TaskId::COUNT];

static void WatchdogInit() {
    const uint32_t now = millis();
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) g_lastHeartbeatMs[i] = now;
}

static inline void Heartbeat(TaskId id) {
    g_lastHeartbeatMs[(size_t)id] = millis();
}

// Devuelve un bitmask con las tareas que llevan demasiado tiempo sin marcar.
static uint8_t WatchdogCheck() {
    const uint32_t now = millis();
    uint8_t faulted = 0;
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) {
        // Resta sin signo: se comporta bien aunque millis() desborde (49 días).
        if ((uint32_t)(now - g_lastHeartbeatMs[i]) > WATCHDOG_TIMEOUT_MS) {
            faulted |= (uint8_t)(1u << i);
        }
    }
    return faulted;
}

// ===========================================================================
//  [6] DRIVER PCA9685 — servos del gripper por I2C
// ===========================================================================
//
//  El PCA9685 es un generador de PWM de 16 canales. Solo hay que configurarle
//  el prescaler una vez y luego escribir 4 bytes por canal. Escribirlo a mano
//  en vez de traer una librería nos cuesta unas 40 líneas y nos deja el
//  control fino del pulso, que es justo lo que hay que ajustar al calibrar
//  un gripper.
//
//  TODAS las funciones devuelven bool. Si el PCA9685 se desconecta, devuelven
//  false y la tarea del gripper sigue viva: un servo mudo no puede colgar al
//  robot entero.

namespace Pca9685 {
    constexpr uint8_t REG_MODE1    = 0x00;
    constexpr uint8_t REG_MODE2    = 0x01;
    constexpr uint8_t REG_LED0_ON_L = 0x06;
    constexpr uint8_t REG_PRESCALE = 0xFE;

    constexpr uint8_t MODE1_RESTART = 0x80;
    constexpr uint8_t MODE1_AI      = 0x20;   // auto-incremento de registro
    constexpr uint8_t MODE1_SLEEP   = 0x10;
    constexpr uint8_t MODE2_OUTDRV  = 0x04;   // salida totem-pole

    bool WriteReg(uint8_t reg, uint8_t value) {
        Wire.beginTransmission(I2CAddr::PCA9685);
        Wire.write(reg);
        Wire.write(value);
        return Wire.endTransmission() == 0;
    }

    bool ReadReg(uint8_t reg, uint8_t &out) {
        Wire.beginTransmission(I2CAddr::PCA9685);
        Wire.write(reg);
        if (Wire.endTransmission(false) != 0) return false;
        if (Wire.requestFrom((int)I2CAddr::PCA9685, 1) != 1) return false;
        out = (uint8_t)Wire.read();
        return true;
    }

    bool Init(uint32_t freq_hz) {
        // El prescaler solo se puede tocar con el chip dormido.
        if (!WriteReg(REG_MODE1, MODE1_SLEEP)) return false;

        // Fórmula de la hoja de datos: oscilador interno de 25 MHz, 4096 pasos.
        const uint32_t prescale = (25000000UL / (4096UL * freq_hz)) - 1UL;
        if (!WriteReg(REG_PRESCALE, (uint8_t)prescale)) return false;

        // Despertar y habilitar el auto-incremento (para escribir 4 bytes seguidos).
        if (!WriteReg(REG_MODE1, MODE1_AI)) return false;
        delayMicroseconds(500);              // el oscilador tarda en estabilizarse
        if (!WriteReg(REG_MODE1, MODE1_AI | MODE1_RESTART)) return false;
        if (!WriteReg(REG_MODE2, MODE2_OUTDRV)) return false;

        uint8_t check = 0;
        return ReadReg(REG_MODE1, check);    // confirma que sigue respondiendo
    }

    // ticks: 0..4095, ancho del pulso dentro del periodo de 20 ms.
    bool SetChannel(uint8_t channel, uint16_t ticks) {
        if (channel > 15) return false;
        if (ticks > 4095) ticks = 4095;

        Wire.beginTransmission(I2CAddr::PCA9685);
        Wire.write(REG_LED0_ON_L + 4 * channel);
        Wire.write(0x00);                      // ON  low   -> el pulso empieza en 0
        Wire.write(0x00);                      // ON  high
        Wire.write((uint8_t)(ticks & 0xFF));   // OFF low
        Wire.write((uint8_t)(ticks >> 8));     // OFF high
        return Wire.endTransmission() == 0;
    }
}

// Convierte un ángulo 0..180 al número de ticks del PCA9685.
static uint16_t ServoAngleToTicks(int angle_deg) {
    angle_deg = constrain(angle_deg, 0, 180);
    return (uint16_t)(Pwm::SERVO_TICK_MIN +
        ((uint32_t)(Pwm::SERVO_TICK_MAX - Pwm::SERVO_TICK_MIN) * (uint32_t)angle_deg) / 180UL);
}

// ===========================================================================
//  [7] DRIVER TCS34725 — sensores de color por I2C
// ===========================================================================
//
//  Los dos sensores son idénticos y comparten la dirección 0x29, que es fija.
//  Por eso cada uno vive en su propio bus (Wire y Wire1) y este driver recibe
//  el bus como parámetro.

namespace Tcs34725 {
    constexpr uint8_t CMD_BIT   = 0x80;   // todo acceso a registro lleva este bit
    constexpr uint8_t CMD_AUTO_INC = 0x20;

    constexpr uint8_t REG_ENABLE  = 0x00;
    constexpr uint8_t REG_ATIME   = 0x01;
    constexpr uint8_t REG_CONTROL = 0x0F;
    constexpr uint8_t REG_ID      = 0x12;
    constexpr uint8_t REG_CDATAL  = 0x14;   // luego R, G, B consecutivos

    constexpr uint8_t ENABLE_PON = 0x01;    // enciende el oscilador interno
    constexpr uint8_t ENABLE_AEN = 0x02;    // habilita el conversor RGBC

