reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
void MotorTask(void *) {
    MotorSetup(kMotorFL);
    MotorSetup(kMotorRL);
    MotorSetup(kMotorFR);
    MotorSetup(kMotorRR);
    MotorsStop();

    MotorCommand current{};                  // por defecto: STOP
    uint32_t last_cmd_ms = millis();

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MOTOR_CONTROL);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        MotorCommand incoming;
        if (xQueueReceive(g_motorCmdQueue, &incoming, 0) == pdTRUE) {
            current = incoming;
            last_cmd_ms = millis();
        }

        // Failsafe propio: no depende de que otra tarea lo detecte por nosotros.
        const bool comms_stale =
            (uint32_t)(millis() - last_cmd_ms) > COMMS_FAILSAFE_TIMEOUT_MS;

        if (comms_stale || current.mode == MotorMode::STOP) {
            MotorsStop();
        } else {
            MotorApply(kMotorFL, current.left);
            MotorApply(kMotorRL, current.left);
            MotorApply(kMotorFR, current.right);
            MotorApply(kMotorRR, current.right);
        }

        Heartbeat(TaskId::MOTOR_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.2  GripperTask — 2 servos vía PCA9685
// ---------------------------------------------------------------------------
//  TODO: calibrar estos cuatro ángulos con el gripper ya montado. Empezar con
//  el servo DESACOPLADO del mecanismo para no forzarlo contra un tope.

constexpr int kClawOpenDeg   = 30;
constexpr int kClawClosedDeg = 120;
constexpr int kLiftUpDeg     = 160;
constexpr int kLiftDownDeg   = 20;

void GripperTask(void *) {
    // El bus I2C ya fue inicializado en setup(); aquí solo se configura el chip.
    bool pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
    if (pca_ok) {
        Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
        Pca9685::SetChannel(ServoChannel::LIFT, ServoAngleToTicks(kLiftUpDeg));
    } else {
        DEBUG_LINK.println("[Gripper] PCA9685 no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::GRIPPER);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Si el PCA9685 no arrancó (cable flojo, alimentación ausente), se
        // reintenta cada segundo sin bloquear nada. El robot puede seguir
        // moviéndose y compitiendo mientras tanto.
        if (!pca_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
        }

        GripperCommand cmd;
        if (xQueueReceive(g_gripperCmdQueue, &cmd, 0) == pdTRUE && pca_ok) {
            // Si el mecanismo se traba, el servo simplemente no llega al
            // ángulo pedido. Esta tarea no se queda esperándolo: manda la
            // orden y sigue, así que un gripper atascado nunca congela a los
            // motores ni al enlace serial.
            switch (cmd.action) {
                case GripperAction::OPEN:
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                    break;
                case GripperAction::CLOSE:
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedDeg));
                    break;
                case GripperAction::RAISE:
                    pca_ok = Pca9685::SetChannel(ServoChannel::LIFT, ServoAngleToTicks(kLiftUpDeg));
                    break;
                case GripperAction::LOWER:
                    pca_ok = Pca9685::SetChannel(ServoChannel::LIFT, ServoAngleToTicks(kLiftDownDeg));
                    break;
            }
        }

        Heartbeat(TaskId::GRIPPER_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

// Empuja un elemento a una cola FIFO descartando el más viejo si está llena.
// Preferimos telemetría fresca a telemetría completa: un dato de sensor de
// hace medio segundo no le sirve de nada a la Raspberry Pi.
template <typename T>
void PushDropOldest(QueueHandle_t queue, const T &item) {
    if (xQueueSend(queue, &item, 0) != pdTRUE) {
        T discard;
        xQueueReceive(queue, &discard, 0);
        xQueueSend(queue, &item, 0);
    }
}

// ---------------------------------------------------------------------------
//  8.3  TofSensorTask — VL53L1X, telémetro delante del gripper
// ---------------------------------------------------------------------------
//
//  Mide la distancia a lo que tenga delante (la bandera, con suerte) para que
//  la Raspberry Pi sepa CUÁNDO cerrar la pinza — igual que ColorSensorTask y
//  ReflectanceTask, esta tarea solo mide y publica: la decisión de cuándo
//  agarrar vive en la Pi (raspberry-pi/src/athena/decision.py).
//
//  SECUENCIA DE ARRANQUE, y por qué es así:
//  el VL53L1X comparte el bus I2C nº1 con el TCS34725 trasero, y los dos
//  chips arrancan en la MISMA dirección fija 0x29 (ver Pins::TOF_XSHUT e
//  I2CAddr::VL53L1X_BOOT_ADDR). La secuencia:
//    1. Mantener XSHUT en LOW un instante: el VL53L1X queda en reset y NO
//       responde en el bus, así que el TCS34725 trasero no tiene con quién
//       chocar mientras tanto.
//    2. Soltar XSHUT (HIGH) y esperar el arranque del sensor.
//    3. Reasignarle una dirección nueva (I2CAddr::VL53L1X) con UNA sola
//       escritura corta — el único instante en que comparte 0x29 con el
//       TCS34725 trasero. Es un riesgo aceptado y documentado (ver la nota
//       larga junto a I2CAddr::VL53L1X_BOOT_ADDR), no un descuido.
//    4. Recién ahora, init() completo: ya en su propia dirección, sin nadie
//       más escuchando en ella.
//
//  Igual que GripperTask con el PCA9685: si el sensor no responde al
//  arranque, se reintenta en segundo plano cada segundo sin bloquear nada.

namespace Tof {
    // El VL53L1X necesita un rato para arrancar tras soltar XSHUT — el
    // datasheet pide ~1.2 ms, se redondea hacia arriba con margen.
    constexpr uint32_t BOOT_DELAY_MS = 2;

