reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // "Long" alcanza los ~4 m que promete el sensor (a costa de un ciclo de
    // medición más largo); de sobra para esta distancia, que es corta por
    // diseño: el sensor solo tiene que ver la bandera cuando ya está frente
    // al gripper.
    constexpr uint16_t TIMING_BUDGET_US = 50000;   // 50 ms
    constexpr uint32_t RANGING_PERIOD_MS = 50;     // igual a TaskPeriodMs::TOF_SENSOR
}

VL53L1X g_tof;   // única instancia: hay un solo sensor ToF en el robot

bool TofBringUp() {
    g_tof.setBus(&Wire1);
    g_tof.setTimeout(500);

    // Ver la nota larga en I2CAddr::VL53L1X_BOOT_ADDR: esta línea es la única
    // transacción que ocurre mientras el VL53L1X sigue en 0x29.
    g_tof.setAddress(I2CAddr::VL53L1X);

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    // El pin ya está en OUTPUT/LOW desde setup() (antes de crear ninguna
    // tarea) — a propósito: algunas placas del VL53L1X traen un pull-up en
    // XSHUT que lo deja activo por defecto, así que si se esperara a este
    // punto para ponerlo en LOW, ColorSensorTask (que corre en paralelo)
    // podría alcanzar a inicializar el TCS34725 trasero mientras el
    // VL53L1X, recién encendido, todavía responde en 0x29 sin que nadie se
    // lo haya pedido. Aquí solo hace falta soltarlo.
    digitalWrite(Pins::TOF_XSHUT, HIGH);    // arranca
    delay(Tof::BOOT_DELAY_MS);

    bool tof_ok = TofBringUp();
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso, igual que GripperTask/ColorSensorTask: un
        // sensor caído no bloquea nada más. No se repite el cambio de
        // dirección aquí — el VL53L1X la conserva mientras tenga
        // alimentación, así que solo hace falta al arrancar.
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            tof_ok = g_tof.init();
            if (tof_ok) {
                g_tof.setDistanceMode(VL53L1X::Long);
                g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
                g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
            }
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        if (tof_ok && g_tof.dataReady()) {
            reading.distance_mm = g_tof.read(false);   // no bloqueante: ya sabemos que hay dato
            reading.valid = !g_tof.timeoutOccurred() &&
                            g_tof.ranging_data.range_status == VL53L1X::RangeValid;
            if (g_tof.timeoutOccurred()) tof_ok = false;   // dejó de responder
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ColorSensorTask — TCS34725 delantero (Wire) y trasero (Wire1)
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    // LED de iluminación de cada sensor, encendidos de forma permanente. Es
    // lo más simple y estable, igual que los emisores IR de los QTR: sin
    // ellos, la clasificación de color dependería de la luz del salón de
    // competencia, que cambia y no se puede controlar.
    pinMode(Pins::TCS_LED_FRONT, OUTPUT);
    pinMode(Pins::TCS_LED_BACK, OUTPUT);
    digitalWrite(Pins::TCS_LED_FRONT, HIGH);
    digitalWrite(Pins::TCS_LED_BACK, HIGH);

    bool front_ok = Tcs34725::Init(Wire);
    bool back_ok  = Tcs34725::Init(Wire1);

    if (!front_ok) DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 0).");
    if (!back_ok)  DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso de los sensores caídos, sin bloquear el resto.
        if ((!front_ok || !back_ok) && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (!front_ok) front_ok = Tcs34725::Init(Wire);
            if (!back_ok)  back_ok  = Tcs34725::Init(Wire1);
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        if (front_ok && Tcs34725::Read(Wire, sample)) {
            reading.front = ClassifyColor(sample);
            reading.front_valid = true;
        } else {
            front_ok = false;                 // se marcará para reintento
        }

        if (back_ok && Tcs34725::Read(Wire1, sample)) {
            reading.back = ClassifyColor(sample);
            reading.back_valid = true;
        } else {
            back_ok = false;
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//
//  CÓMO SE LEE ESTE SENSOR (importante, porque es contraintuitivo):
//  el QTR entrega un voltaje INVERSAMENTE proporcional a la reflectancia.
//  Superficie clara -> mucha luz IR rebotada -> el fototransistor conduce ->
//  la salida cae cerca de 0 V. Superficie oscura -> poca luz rebotada ->
//  la salida sube cerca de VIN.
//
//  O sea: valor ADC ALTO = superficie OSCURA (cinta negra).
//
//  ¡ALIMENTAR EL QTRX A 3.3 V! Su salida es proporcional a su VIN: alimentado
//  a 5 V entregaría hasta 5 V en un pin de ADC que solo tolera 3.3 V.

