reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// TODO: calibrar sobre la pista real, con la luz del salón de competencia.
// El script raspberry-pi/scripts/ ayuda a leer los valores en vivo.
constexpr uint16_t kDarkThreshold = 2048;   // ADC de 12 bits -> rango 0..4095

void ReflectanceTask(void *) {
    analogReadResolution(12);

    // Atenuación de 11 dB: extiende el rango útil del ADC a ~0..3.1 V, que es
    // lo que necesitamos para leer la excursión completa del QTR a 3.3 V.
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    // Emisores IR encendidos de forma permanente. Es lo más simple y estable;
    // si más adelante hace falta compensar la luz ambiente, se apagan aquí,
    // se toma una lectura, se encienden y se resta.
    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB indicador de equipo (lo exige el reglamento)
// ---------------------------------------------------------------------------
//  Hasta hace poco esto eran 2 LED discretos (rojo/azul) con digitalWrite.
//  El equipo los reemplazó por un único LED RGB (validado primero en
//  pruebas-platformio/02-cuadro-color-rgb/), así que ahora se maneja por PWM.
//  Queda con margen para lo que haga falta más adelante: cualquier otra señal
//  visual se resuelve mezclando los 3 canales, sin cablear nada nuevo.

namespace RgbLed {
    // Canales LEDC 4..6: los motores ya ocupan 0..3 (ver 8.1).
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD SIN CONFIRMAR con el LED físico (mismo TODO que en la prueba
    // 02): se asume cátodo común, duty alto = canal más brillante. Si al
    // probarlo los colores salen invertidos, es ánodo común — cambiar esta
    // constante a true, no hace falta tocar el resto de la tarea.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    void ApplyTeam(TeamColor team) {
        switch (team) {
            case TeamColor::RED:  SetRaw(255, 0, 0); break;
            case TeamColor::BLUE: SetRaw(0, 0, 255); break;
            case TeamColor::NONE:
            default:              SetRaw(0, 0, 0);   break;
        }
    }
}

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

    TeamColor team = TeamColor::NONE;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) team = cmd.team;

        RgbLed::ApplyTeam(team);

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.7  SerialTask — único punto de contacto con la Raspberry Pi
// ---------------------------------------------------------------------------
//  Es la ÚNICA tarea que toca el enlace con la RPi. Ninguna otra escribe en
//  él, así que no hace falta un mutex para el puerto.
//
//  El receptor es una máquina de estados que consume byte a byte. Nunca
//  bloquea esperando el resto de una trama: si el paquete llega partido en
//  varios pedazos (cosa normal), simplemente retoma donde quedó en la vuelta
//  siguiente. Cualquier byte suelto o checksum malo lo devuelve a WAIT_START,
//  de modo que una trama corrupta no puede trabar el enlace.

enum class RxState : uint8_t { WAIT_START, READ_TYPE, READ_LEN, READ_PAYLOAD, READ_CHECKSUM };

void SerialSendPacket(uint8_t type, const uint8_t *payload, uint8_t len) {
    if (len > Proto::MAX_PAYLOAD) return;

    // 4 bytes de sobrecarga: START, TYPE, LEN y CHECKSUM.
    uint8_t buf[4 + Proto::MAX_PAYLOAD];
    buf[0] = Proto::START_BYTE;
    buf[1] = type;
    buf[2] = len;
    memcpy(&buf[3], payload, len);
    buf[3 + len] = Proto::Checksum(type, len, payload);
    RPI_LINK.write(buf, (size_t)(4 + len));
}

// Despacha un paquete ya validado hacia la cola que le toca.
void SerialDispatch(uint8_t type, const uint8_t *payload, uint8_t len) {
    switch (type) {
        case Proto::CMD_MOTOR: {
            if (len != Proto::LEN_CMD_MOTOR) return;
            MotorCommand cmd;
            cmd.mode  = (payload[0] == 1) ? MotorMode::DRIVE : MotorMode::STOP;
            cmd.left  = (int8_t)payload[1];
            cmd.right = (int8_t)payload[2];
            xQueueOverwrite(g_motorCmdQueue, &cmd);
            break;
        }
        case Proto::CMD_GRIPPER: {
            if (len != Proto::LEN_CMD_GRIPPER) return;
            if (payload[0] > (uint8_t)GripperAction::LOWER) return;
            GripperCommand cmd;
            cmd.action = (GripperAction)payload[0];
            xQueueSend(g_gripperCmdQueue, &cmd, 0);
            break;
        }
        case Proto::CMD_LED: {
            if (len != Proto::LEN_CMD_LED) return;
            if (payload[0] > (uint8_t)TeamColor::BLUE) return;
            LedCommand cmd;
            cmd.team = (TeamColor)payload[0];
            xQueueOverwrite(g_ledCmdQueue, &cmd);
            break;
        }
        default:
            break;   // tipo desconocido: se ignora, el enlace sigue vivo
    }
}

