reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
} // namespace anónimo

// ===========================================================================
//  [9] setup() / loop()
// ===========================================================================

static bool CreateQueues() {
    g_motorCmdQueue   = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue     = xQueueCreate(1, sizeof(LedCommand));
    g_colorQueue      = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue    = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue        = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue     = xQueueCreate(1, sizeof(HealthReport));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue;
}

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);   // consola por el puerto UART del DevKit
    RPI_LINK.begin(SERIAL_BAUD_RATE);     // enlace USB con la Raspberry Pi
    delay(200);
    DEBUG_LINK.println("\nAthena Rover 2026 - firmware ESP32-S3");

    // Los dos buses I2C se abren aquí, ANTES de lanzar las tareas, para que
    // ninguna tarea tenga que inicializar hardware compartido.
    Wire.begin(Pins::I2C0_SDA, Pins::I2C0_SCL, 400000);   // PCA9685 + TCS34725 delantero
    Wire1.begin(Pins::I2C1_SDA, Pins::I2C1_SCL, 400000);  // TCS34725 trasero

    // Timeout corto: si un chip I2C se cuelga tirando SDA a masa, la
    // transacción falla rápido en vez de congelar la tarea que la pidió.
    Wire.setTimeOut(25);
    Wire1.setTimeOut(25);

    // VL53L1X en reset DESDE YA, antes de crear ninguna tarea. Ver la nota
    // larga en TofSensorTask: si se dejara este pin sin tocar hasta que esa
    // tarea arranque, ColorSensorTask (que corre en paralelo, en el mismo
    // bus I2C1) podría alcanzar a inicializar el TCS34725 trasero mientras
    // el VL53L1X sigue respondiendo en 0x29 por su cuenta (algunas placas
    // traen un pull-up en XSHUT que lo deja activo apenas se energiza).
    // Haciéndolo aquí, en setup(), antes de xTaskCreatePinnedToCore, queda
    // garantizado que pasa antes que cualquier tarea toque el bus.
    pinMode(Pins::TOF_XSHUT, OUTPUT);
    digitalWrite(Pins::TOF_XSHUT, LOW);

    if (!CreateQueues()) {
        // Sin colas no hay comunicación entre tareas: arrancar a medias sería
        // peor que no arrancar, porque el robot se movería sin poder frenar.
        DEBUG_LINK.println("[FATAL] no se pudieron crear las colas. Arranque detenido.");
        for (;;) delay(1000);
    }

    // Los heartbeats se inicializan ANTES de crear ninguna tarea. Si se
    // hiciera después, se borrarían las marcas de las tareas que ya arrancaron
    // y el supervisor las vería como recién nacidas.
    WatchdogInit();

    xTaskCreatePinnedToCore(SupervisorTask, "Supervisor", TaskStack::SUPERVISOR,
                            nullptr, TaskPriority::SUPERVISOR, nullptr, 0);
    xTaskCreatePinnedToCore(SerialTask, "SerialComm", TaskStack::SERIAL_COMM,
                            nullptr, TaskPriority::SERIAL_COMM, nullptr, 1);
    xTaskCreatePinnedToCore(MotorTask, "Motors", TaskStack::MOTOR_CONTROL,
                            nullptr, TaskPriority::MOTOR_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(GripperTask, "Gripper", TaskStack::GRIPPER_CONTROL,
                            nullptr, TaskPriority::GRIPPER_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(ColorSensorTask, "ColorSensors", TaskStack::COLOR_SENSOR,
                            nullptr, TaskPriority::COLOR_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(TofSensorTask, "TofSensor", TaskStack::TOF_SENSOR,
                            nullptr, TaskPriority::TOF_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(ReflectanceTask, "Reflectance", TaskStack::REFLECTANCE,
                            nullptr, TaskPriority::REFLECTANCE, nullptr, 0);
    xTaskCreatePinnedToCore(LedTask, "TeamLed", TaskStack::LED_STATUS,
                            nullptr, TaskPriority::LED_STATUS, nullptr, 0);

    DEBUG_LINK.println("Todas las tareas lanzadas.");
}

void loop() {
    // Todo el trabajo ocurre en las tareas. loop() se queda vacío a propósito.
    vTaskDelay(pdMS_TO_TICKS(1000));
}
